# Numpy: Package for Multidimensional array

In [ ]:
import numpy as np

In [ ]:
simple_list=[6,7,9]
np.array(simple_list)

In [ ]:
arr=np.array([1,2,3])
arr

In [ ]:
list_of_lists=[[1,2,3],[4,5,6],[7,8,9]]
np.array(list_of_lists)

In [ ]:
np.arange(5,65)

In [ ]:
np.arange(1,30,2)

In [ ]:
np.zeros(10)

In [ ]:
np.zeros(10,int)

In [ ]:
np.ones(10)

In [ ]:
np.ones(10,int)

In [ ]:
np.ones((2,5))

In [ ]:
np.linspace(0,1,5)

In [ ]:
np.linspace(0,20,8)

In [ ]:
np.eye(10)

In [ ]:
np.random.rand(2,4)

In [ ]:
arr=np.random.randn(2,4)
arr

In [ ]:
np.random.randint(2,10)

In [ ]:
np.random.randint(20,56,100)

In [ ]:
sample_array=np.arange(30)
sample_array

In [ ]:
rand_array=np.random.randint(0,100,20)
rand_array

In [ ]:
sample_array.reshape(5,6)

In [ ]:
rand_array.min()

In [ ]:
rand_array.argmin()

In [ ]:
sample_array

In [ ]:
sample_array.shape

In [ ]:
sample_array.reshape(5,6)

In [ ]:
sample_array.reshape(4,7)

In [ ]:
sample_array.dtype

In [ ]:
a=np.eye(5)
a

In [ ]:
a.T

In [ ]:
a=np.random.rand(2,3)
a

In [ ]:
a.T

In [ ]:
sample_array=np.arange(10,21)
sample_array

In [ ]:
sample_array[8]

In [ ]:
sample_array[2:5]

In [ ]:
sample_array[1:4]=100
sample_array

In [ ]:
sample_array=np.arange(10,21)
sample_array

In [ ]:
sample_array[0:7]

In [ ]:
subset_sample_array=sample_array[0:7]
subset_sample_array

In [ ]:
subset_sample_array[:]=1001
subset_sample_array

### Two-Dimensional array

In [ ]:
import numpy as np

In [ ]:
sample_matrix=np.array(([50,20,1,23],[24,23,21,33],[56,76,24,7]))
sample_matrix

In [ ]:
sample_matrix[0][2]

In [ ]:
sample_matrix[2,:]

In [ ]:
sample_matrix[2]

### Custom indexing

In [ ]:
sample_matrix=np.array(([30,10,1,23],[24,21,32,33],[6,76,24,7]))
sample_matrix

In [ ]:
sample_matrix[:,(3,2)]

###  Selection techniques

In [ ]:
sample_array=np.arange(1,20)

In [ ]:
sample_array

In [ ]:
sample_array+sample_array

In [ ]:
np.exp(sample_array) # exponential

In [ ]:
np.sqrt(sample_array)

In [ ]:
np.log(sample_array)

In [ ]:
np.max(sample_array)

In [ ]:
np.min(sample_array)

In [ ]:
np.argmax(sample_array)

In [ ]:
np.argmin(sample_array)

In [ ]:
np.square(sample_array)

In [ ]:
np.std(sample_array)

In [ ]:
np.var(sample_array)

In [ ]:
np.mean(sample_array)

In [ ]:
array=np.random.randn(3,4)
array

In [ ]:
np.round(array,decimals=2)

In [ ]:
sports=np.array(['golf','cricket','fball','cricket'])
np.unique(sports)

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
labels=['w','x','y','z']
sample_list=[10,20,30,40]
array=np.array([1,2,3,4])
dict={'w':10,'x':20,'y':30,'z':40}

In [ ]:
pd.Series(data=sample_list)

In [ ]:
pd.Series(data=sample_list,index=labels)

In [ ]:
pd.Series(array,labels)

In [ ]:
pd.Series(dict)

### Pandas dataframe and indexing

In [ ]:
sports1=pd.Series([1,2,3,4],index=['cricket','football','basketball','golf'])
sports1

In [ ]:
sports1['football']

In [ ]:
sports2=pd.Series([11,2,3,4],index=['cricket','football','baseball','golf'])
sports2

In [ ]:
sports1+sports2

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
df1=pd.DataFrame(np.random.randn(8,5),index='A B C D E F G H '.split(),columns='Score1 Score2 Score3 Score4 Score5'.split())
df1

In [ ]:
df1["Score1"]

In [ ]:
df1[["Score1","Score2"]]

In [ ]:

df1['Score6']=df1['Score1']+df1['Score2']
df1

In [ ]:
df2={'ID':['101','102','103','107','176'],'Name':['John','Mercy','Akash','Kavin','Lally'],'Profit':[20,54,56,87,123]}
df=pd.DataFrame(df2)
df

In [ ]:
df["ID"]

### How to import Dataset using Pandas?

In [4]:
import numpy as np
import pandas as pd

In [5]:
df=pd.read_csv("https://raw.githubusercontent.com/Premalatha-success/HHE_June5/main/CardioGoodFitness-1.csv")

In [6]:
df.head()

  Product  Age  Gender  Education MaritalStatus  Usage  Fitness  Income  Miles
0   TM195   18    Male         14        Single      3        4   29562    112
1   TM195   19    Male         15        Single      2        3   31836     75
2   TM195   19  Female         14     Partnered      4        3   30699     66
3   TM195   19    Male         12        Single      3        3   32973     85
4   TM195   20    Male         13     Partnered      4        2   35247     47

In [7]:
df.head(10)

  Product  Age  Gender  Education MaritalStatus  Usage  Fitness  Income  Miles
0   TM195   18    Male         14        Single      3        4   29562    112
1   TM195   19    Male         15        Single      2        3   31836     75
2   TM195   19  Female         14     Partnered      4        3   30699     66
3   TM195   19    Male         12        Single      3        3   32973     85
4   TM195   20    Male         13     Partnered      4        2   35247     47
5   TM195   20  Female         14     Partnered      3        3   32973     66
6   TM195   21  Female         14     Partnered      3        3   35247     75
7   TM195   21    Male         13        Single      3        3   32973     85
8   TM195   21    Male         15        Single      5        4   35247    141
9   TM195   21  Female         15     Partnered      2        3   37521     85

In [8]:
df.tail()

,Product,Age,Gender,Education,MaritalStatus,Usage,Fitness,Income,Miles
175,TM798,40,Male,21,Single,6,5,83416,200
176,TM798,42,Male,18,Single,5,4,89641,200
177,TM798,45,Male,16,Single,5,5,90886,160
178,TM798,47,Male,18,Partnered,4,5,104581,120
179,TM798,48,Male,18,Partnered,4,5,95508,180

In [9]:
df.tail(10)

,Product,Age,Gender,Education,MaritalStatus,Usage,Fitness,Income,Miles
170,TM798,31,Male,16,Partnered,6,5,89641,260
171,TM798,33,Female,18,Partnered,4,5,95866,200
172,TM798,34,Male,16,Single,5,5,92131,150
173,TM798,35,Male,16,Partnered,4,5,92131,360
174,TM798,38,Male,18,Partnered,5,5,104581,150
175,TM798,40,Male,21,Single,6,5,83416,200
176,TM798,42,Male,18,Single,5,4,89641,200
177,TM798,45,Male,16,Single,5,5,90886,160
178,TM798,47,Male,18,Partnered,4,5,104581,120
179,TM798,48,Male,18,Partnered,4,5,95508,180

In [10]:
df.shape

(180, 9)

In [11]:
df.dtypes

Product          object
Age               int64
Gender           object
Education         int64
MaritalStatus    object
Usage             int64
Fitness           int64
Income            int64
Miles             int64
dtype: object

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 180 entries, 0 to 179
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Product        180 non-null    object
 1   Age            180 non-null    int64
 2   Gender         180 non-null    object
 3   Education      180 non-null    int64
 4   MaritalStatus  180 non-null    object
 5   Usage          180 non-null    int64
 6   Fitness        180 non-null    int64
 7   Income         180 non-null    int64
 8   Miles          180 non-null    int64
dtypes: int64(6), object(3)
memory usage: 12.8+ KB

In [13]:
df.describe()

,Age,Education,Usage,Fitness,Income,Miles
count,180.000000,180.000000,180.000000,180.000000,180.000000,180.000000
mean,28.788889,15.572222,3.455556,3.311111,53719.577778,103.194444
std,6.943498,1.617055,1.084797,0.958869,16506.684226,51.863605
min,18.000000,12.000000,2.000000,1.000000,29562.000000,21.000000
25%,24.000000,14.000000,3.000000,3.000000,44058.750000,66.000000
50%,26.000000,16.000000,3.000000,3.000000,50596.500000,94.000000
75%,33.000000,16.000000,4.000000,4.000000,58668.000000,114.750000
max,50.000000,21.000000,7.000000,5.000000,104581.000000,360.000000

In [14]:
df.describe(include="all")

,Product,Age,Gender,Education,MaritalStatus,Usage,Fitness,Income,Miles
count,180,180.000000,180,180.000000,180,180.000000,180.000000,180.000000,180.000000
unique,3,NaN,2,NaN,2,NaN,NaN,NaN,NaN
top,TM195,NaN,Male,NaN,Partnered,NaN,NaN,NaN,NaN
freq,80,NaN,104,NaN,107,NaN,NaN,NaN,NaN
mean,NaN,28.788889,NaN,15.572222,NaN,3.455556,3.311111,53719.577778,103.194444
std,NaN,6.943498,NaN,1.617055,NaN,1.084797,0.958869,16506.684226,51.863605
min,NaN,18.000000,NaN,12.000000,NaN,2.000000,1.000000,29562.000000,21.000000
25%,NaN,24.000000,NaN,14.000000,NaN,3.000000,3.000000,44058.750000,66.000000
50%,NaN,26.000000,NaN,16.000000,NaN,3.000000,3.000000,50596.500000,94.000000
75%,NaN,33.000000,NaN,16.000000,NaN,4.000000,4.000000,58668.000000,114.750000
max,NaN,50.000000,NaN,21.000000,NaN,7.000000,5.000000,104581.000000,360.000000